app/controllers/authentication_controller.rb

  def authenticate
    @user = User.find_by_email(params[:email])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "nandy@yahoo.in"], ["LIMIT", 1]]

  def logout
    if @current_user
      @current_user.token = nil
      @current_user.save
---
UPDATE "users" SET "tokenhash" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["tokenhash", "---\n127.0.0.1: R2PdMsQDmo1s2GJQ7yQkL9Pg\n192.168.43.148: zYMgkGx2f4XVTWNrJrdMJyoZ\n"], ["updated_at", "2018-07-21 11:19:16.316986"], ["id", 1]]