app/controllers/users_controller.rb

INSERT INTO "users" ("username", "email", "password_digest", "created_at", "updated_at", "token", "address", "mobile") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(users_params)
    if @user.save

INSERT INTO "users" ("username", "email", "password_digest", "created_at", "updated_at", "token", "address", "mobile", "created_by") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def add_user
    @user = User.new(email:params[:email],username:params[:username],address:params[:address],mobile:params[:mobile],password:"root",password_confirmation:"root",created_by:@current_user.id)
    if @user.save

SELECT "users"."id", "users"."email", "users"."username", "users"."mobile", "users"."address" FROM "users" WHERE "users"."created_by" = ?  [["created_by", 1]]
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "nandy@yahoo.in"], ["LIMIT", 1]]
---
  def all_users
    @user = User.where(created_by: @current_user.id).select(:id,:email,:username,:mobile,:address)
    if @user.present?